music_app/app/views/albums/edit.html.erb

      <option disabled>Choose Band</option>
      <% bands = Band.all %>
---
SELECT "bands".* FROM "bands"