music_app/app/views/albums/new.html.erb

SELECT "bands".* FROM "bands"
---
      <option selected disabled>Choose Band</option>
      <% bands = Band.all %>