music_app/app/controllers/albums_controller.rb

  def create #create new album
    @album = Album.new(album_params)
    band = @album.band
    if @album.save!
---
INSERT INTO "albums" ("title", "year", "band_id", "live_album", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Album #1"], ["year", 1999], ["band_id", 3], ["live_album", true], ["created_at", "2018-11-15 22:11:13.583116"], ["updated_at", "2018-11-15 22:11:13.583116"]]

  def edit #show edit album page
    @album = Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def show #show individual album page
    @album = Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update #update existing album
    @album = Album.find_by(id: params[:id])

    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "albums" SET "band_id" = $1, "live_album" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["band_id", 4], ["live_album", true], ["updated_at", "2018-11-15 22:51:40.536826"], ["id", 5]]

  def destroy #delete album
    @album = Album.find_by(id: params[:id])
    band = @album.band
    @album.destroy if @album
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]