music_app/app/controllers/bands_controller.rb

  def create #create new band
    @band = Band.new(band_params)
    if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Band #1"], ["created_at", "2018-11-15 21:05:47.868805"], ["updated_at", "2018-11-15 21:05:47.868805"]]

  def edit #show edit band page
    @band = Band.find_by(id: params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def show #show individual band page
    @band = Band.find_by(id: params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def update #update existing band
    @band = Band.find_by(id: params[:id])

    if @band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "The 3rd Band !!!"], ["updated_at", "2018-11-15 22:49:18.240327"], ["id", 3]]

  def destroy #delete band
    @band = Band.find_by(id: params[:id])
    @band.destroy if @band
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]