music_app/app/controllers/tracks_controller.rb

  def create #create new track
    @track = Track.new(track_params)
    album = @track.album
    if @track.save!
---
INSERT INTO "tracks" ("title", "ord", "regular_track", "created_at", "updated_at", "album_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "New Track for Album 2"], ["ord", 34], ["regular_track", false], ["created_at", "2018-11-16 00:17:26.330726"], ["updated_at", "2018-11-16 00:17:26.330726"], ["album_id", 4]]

  def edit #show edit track page
    @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show #show individual track page
    @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update #update existing track
    @track = Track.find_by(id: params[:id])

    if @track.update(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "title" = $1, "ord" = $2, "regular_track" = $3, "updated_at" = $4 WHERE "tracks"."id" = $5  [["title", "My First Track is now 12!"], ["ord", 12], ["regular_track", true], ["updated_at", "2018-11-16 00:12:18.060802"], ["id", 1]]

  def destroy #delete track
    @track = Track.find_by(id: params[:id])
    album = @track.album
    @track.destroy if @track
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 1]]