music_app/app/views/bands/index.html.erb


<% bands = Band.all %>
---
SELECT "bands".* FROM "bands"