music_app/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 3]]
---
<p>Albums</p>
<% albums = Album.where(band_id: @band.id)%>