music_app/app/views/tracks/edit.html.erb

SELECT "albums".* FROM "albums"
---
      <option selected disabled>Choose Band</option>
      <% albums = Album.all %>