music_app/app/views/tracks/new.html.erb

      <option selected disabled>Choose Band</option>
      <% albums = Album.all %>
---
SELECT "albums".* FROM "albums"